### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [57]:
# Dependencies and Setup
import pandas as pd
import os

# File to Load (Remember to Change These)
file = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
file_df = pd.read_csv(file)
file_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [58]:
file_df.isnull().any()

Purchase ID    False
SN             False
Age            False
Gender         False
Item ID        False
Item Name      False
Price          False
dtype: bool

In [59]:
total_players = file_df["SN"].nunique()
total_players

576

## Player Count

* Display the total number of players

In [60]:
pd.DataFrame({"Total Players": [total_players]})

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [61]:
unique_items = file_df["Item ID"].nunique()
unique_items

avg_price = file_df["Price"].mean()
avg_price

purchase_num = file_df["Purchase ID"].count()
purchase_num

revenue = file_df["Price"].sum()
revenue

2379.77

In [62]:
summary_df = pd.DataFrame({"Number of Unique Items": [unique_items],
                          "Average Price": [avg_price],
                          "Number of Purchases": [purchase_num],
                          "Total Revenue": [revenue]})
summary_df["Average Price"] = summary_df["Average Price"].map("${:,.2f}".format)
summary_df["Total Revenue"] = summary_df["Total Revenue"].map("${:,.2f}".format)
summary_df.head()

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     179         $3.05                  780     $2,379.77

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [63]:
total_df = file_df["Gender"].value_counts()
total_df

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [64]:
gender_total_df = file_df["Gender"].count()
gender_total_df

780

In [65]:
percentage_df = (total_df/gender_total_df)*100
percentage_df

Male                     83.589744
Female                   14.487179
Other / Non-Disclosed     1.923077
Name: Gender, dtype: float64

In [66]:
gender_df = pd.DataFrame({"Count": total_df, "Percentage": percentage_df})
gender_df["Percentage"] = gender_df["Percentage"].map("{:,.2f}%".format)
gender_df

                       Count Percentage
Male                     652     83.59%
Female                   113     14.49%
Other / Non-Disclosed     15      1.92%


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [67]:
female_df = file_df[file_df["Gender"] == "Female"]
female_df.head()

male_df = file_df[file_df["Gender"] == "Male"]
male_df.head()

others_df = file_df[file_df["Gender"] == "Other / Non-Disclosed"]
others_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
9,9,Chanosian48,35,Other / Non-Disclosed,136,Ghastly Adamantite Protector,3.58
22,22,Siarithria38,38,Other / Non-Disclosed,24,Warped Fetish,3.81
82,82,Haerithp41,16,Other / Non-Disclosed,160,Azurewrath,4.40
111,111,Sundim98,21,Other / Non-Disclosed,41,Orbit,4.75
228,228,Jiskirran77,20,Other / Non-Disclosed,80,Dreamsong,3.39

In [68]:
grouped_gender = file_df.groupby(["Gender"])
print(grouped_gender)
grouped_gender.count().head(10)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f82647bfca0>

                       Purchase ID   SN  Age  Item ID  Item Name  Price
Gender
Female                         113  113  113      113        113    113
Male                           652  652  652      652        652    652
Other / Non-Disclosed           15   15   15       15         15     15

In [69]:
avg_purchase = grouped_gender["Price"].mean()

total_purchase_by_gender = grouped_gender["Price"].sum()

purchase_count = grouped_gender["Purchase ID"].count()

avg_total_purchase_per_person = (total_purchase_by_gender / total_df)
avg_total_purchase_per_person

Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
dtype: float64

In [70]:
purchase_analysis = pd.DataFrame({"Purchase Count": purchase_count,
                                 "Average Purchase Price": avg_purchase,
                                 "Total Purchase Value": total_purchase_by_gender,
                                 "Avg Total Purchase per Person": avg_total_purchase_per_person})
purchase_analysis
#question: why the avg. total purchase per person is wrong?

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.203009,361.94,3.203009
Male,652,3.017853,1967.64,3.017853
Other / Non-Disclosed,15,3.346000,50.19,3.346000

## Age Demographics

In [71]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 100]

bins_name = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [72]:
file_df["Age Ranges"] = pd.cut(file_df["Age"], bins, labels=bins_name)
file_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Ranges
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,20-24

In [73]:
age_grouped = file_df.groupby(["Age Ranges"])
age_grouped

In [74]:
age_count = age_grouped["SN"].nunique()
#age_count
age_percent = (age_count / total_players) * 100
age_percent

Age Ranges
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    44.791667
25-29    13.368056
30-34     9.027778
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [75]:
age_df = pd.DataFrame({"Total Count": age_count,
                      "Percentage of Players": age_percent})
age_df["Percentage of Players"] = age_df["Percentage of Players"].map("{:.2f}%".format)
age_df

            Total Count Percentage of Players
Age Ranges
<10                  17                 2.95%
10-14                22                 3.82%
15-19               107                18.58%
20-24               258                44.79%
25-29                77                13.37%
30-34                52                 9.03%
35-39                31                 5.38%
40+                  12                 2.08%

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [76]:
avg_purchase_age = age_grouped["Price"].mean()

total_purchase_age = age_grouped["Price"].sum()

purchase_count_age = age_grouped["Purchase ID"].count()

avg_total_purchase_per_person_age = (total_purchase_age / age_count)

In [88]:
purchase_analysis_age = pd.DataFrame({"Purchase Count": purchase_count_age,
                                 "Average Purchase Price": avg_purchase_age,
                                 "Total Purchase Value": total_purchase_age,
                                 "Avg Total Purchase per Person": avg_total_purchase_per_person_age})
purchase_analysis_age["Average Purchase Price"] = purchase_analysis_age["Average Purchase Price"].map("${:,.2f}".format)
purchase_analysis_age["Total Purchase Value"] = purchase_analysis_age["Total Purchase Value"].map("${:,.2f}".format)
purchase_analysis_age["Avg Total Purchase per Person"] = purchase_analysis_age["Avg Total Purchase per Person"].map("${:,.2f}".format)

purchase_analysis_age

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [99]:
spenders = file_df["SN"].value_counts()

grouped_spender = file_df.groupby(["SN"])
print(grouped_spender)

total_spender = grouped_spender["Price"].sum()
total_spender

purchase_count_spender = grouped_spender["Purchase ID"].count()
purchase_count_spender

avg_total_purchase_per_spender = (total_spender / purchase_count_spender)
avg_total_purchase_per_spender

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x7f82647ed1f0>

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Length: 576, dtype: float64

In [101]:
spenders_analysis = pd.DataFrame({"Purchase Count": purchase_count_spender,
                                 "Average Purchase Price": avg_total_purchase_per_spender,
                                 "Total Purchase Value": total_spender})

spenders_analysis["Average Purchase Price"] = spenders_analysis["Average Purchase Price"].map("${:,.2f}".format)
spenders_analysis["Total Purchase Value"] = spenders_analysis["Total Purchase Value"].map("${:,.2f}".format)

spenders_analysis.sort_values("Purchase Count", ascending=False)

              Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                  5                  $3.79               $18.96
Iral74                     4                  $3.40               $13.62
Idastidru52                4                  $3.86               $15.45
Asur53                     3                  $2.48                $7.44
Inguron55                  3                  $3.70               $11.11
...                      ...                    ...                  ...
Hala31                     1                  $1.02                $1.02
Haisurra41                 1                  $4.40                $4.40
Hailaphos89                1                  $3.81                $3.81
Haestyphos66               1                  $1.97                $1.97
Iskosian40                 1                  $3.07                $3.07

[576 rows x 3 columns]

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame